Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G64.tmx
Source language: en_us
Languages: zh_cn

source: Once upon a time in Peking
zh_cn: 北京往事

source: "THEY WERE BEHEADING someone.
zh_cn: “他们正在砍某人的头。

source: We were driving down a narrow street in the centre of town, and came out into a big square,Tiananmen Square for all I know - at which point my nanny thrust me to the floor of the car so that I wouldn't see what was going on."
zh_cn: 我们正开车经过城区中心的一条窄巷，接着便来到了一处开阔的广场，就我所知是天安门广场——就在这时，我的保姆把我猛地推到车厢底下，为了不让我看到正在发生的事情。”

source: My father is one of a handful of Westerners alive today, perhaps no more than a dozen, to have lived in Peking during the 1930s.
zh_cn: 我的父亲是为数不多的，于上世纪30年代在北京生活过，还健在的西方人，也许多不过十几个。

source: His recollections fanned the image of China I grew up with, which probably only ever existed on the snuff bottles that his parents brought home to Worcestershire, along with miniature trees dangling with jade leaves, intricately carved camphor-wood chests and paintings of mountain temples on brown silk.
zh_cn: 他的回想吹起了记忆中伴我成长的有关中国的影像，或许仅仅是与我祖父母带回来的，伍斯特郡家里的鼻烟壶有关，连同悬垂着翠绿色叶子的盆栽，精雕细琢的樟木箱，以及描绘于褐色丝帛上的山间寺庙画。

source: Never having visited China, I persuaded my father last autumn to accompany me as a guide through the fabled walled city of his boyhood.
zh_cn: 出于从未到访过中国，去年秋天，我游说我的父亲作为向导，来伴随我一同游历了传说中他少年时代时的古老城市。

source: I wanted to see through his eyes the changes that none of us can avoid hearing about.
zh_cn: 我意欲通过他的视角，来目睹我们无一可以回避听闻的，它的变迁。

source: CHILD OF the Empire, my father saw out its last moments.
zh_cn: 我的父亲，一个大英帝国的孩子，见证了它的最后时刻。

source: He is an example of the speed with which national fortunes change.
zh_cn: 他相当于国家命运变幻速度的一个范例。

source: In January 1936, aged five, wearing a black armband because George V had just died, he boarded the troop ship Neuralia, taking his father out to Peking on his posting there as medical officer to the garrison guarding the British Legation.
zh_cn: 1936年1月，时年五岁的他，戴着祭奠乔治五世刚刚驾崩的黑臂纱，登上了Neuralia号运兵船，跟随他的父亲来到了北京，我祖父任职英国公使馆卫戍部队医疗官的所在地。“

source: "I can remember the beef tea served by stewards on the upper deck every day at 11am," he says, "and the soldiers noisily playing Housey Housey [a form of bingo] on the decks below." The journey along the great imperial route lasted six weeks - as opposed to six and a half days by the more expensive Imperial Airways flying-boat.
zh_cn: 我能记得每天上午11点时，在上层甲板上由服务员送来的牛肉汤，”他说，“士兵们在下面的甲板上吵嚷地玩着‘回家’游戏[一种宾果游戏]。”沿着大英帝国附属地路线而行的旅途，持续了六个星期——与乘坐更加昂贵的帝国航空飞艇六天半的旅程截然相反。

source: "We stopped at all the British bases, either to disembark detachments of troops or to take on coal.
zh_cn: “我们在所有的英军基地作了停留，或是让军队分遣队登陆，或是补给煤炭。”

source: Gibraltar, Malta, Port Said, Aden, Bombay, Penang, Singapore and Hong Kong.
zh_cn: 在直布罗陀、马耳他、塞得港、亚丁、孟买、槟榔屿、新加坡以及香港。

source: On the way from Hong Kong we stopped at Shanghai, which was also a British concession.
zh_cn: 在离开香港的途中，我们在同为英租界的上海作了停留。

source: This meant in effect that throughout the long journey we never once set foot on foreign soil.
zh_cn: 这实际上意味着在这次长途旅行中，我们自始至终从未踏足过异国他地。

source: At every port, the Union Flag was proudly flying and Royal Navy gunboats lay at anchor in the harbour."
zh_cn: 每个港口都飘扬着英国国旗，皇家海军炮艇在海港里停泊着。

source: At the time, Britain remained the chief foreign power in China.
zh_cn: 那个时候，中国境内主要的外国势力仍来自于英国。

source: By contrast, China had the sort of status Vladimir Putin sees when he calls today's Britain a small island no one pays any attention to.
zh_cn: 相比之下，在弗拉基米尔?普京（Vladimir Putin）将现今的英国称作为无足轻重的小岛国时，中国却拥有了他所预见的那种地位。

source: In 1936 China accounted for a mere 1.3% of British trade abroad, according to the British ambassador, Sir Hughe Knatchbull-Hugessen (today it is more than twice that).
zh_cn: 1936年，中国仅仅占有英国1.3%的对外贸易份额，根据当时的英国驻华大使许阁森爵士（Sir Hughe Knatchbull-Hugessen）所称（现在是原先的两倍多）。

source: On the list of Britain's customers, China ranked 25th.
zh_cn: 在英国的客户名录上，中国名列第25位。

source: "When I was young," my father says, "it was inconceivable that this country would dominate the world financially."
zh_cn: “在我年轻时，”我父亲说，“无法想象这个国家将在世界财政大局中居于主导地位。”

source: The last leg of the journey was by train.
zh_cn: 我们乘坐火车完成了最后一段旅程。

source: After hours of empty desert and monotonous grassland, suddenly, there on its plain, nestling in a crook of mountains, was a vast walled garden containing 1.5m inhabitants.
zh_cn: 数个小时荒无人烟的沙漠和千篇一律的草原之后，突如其来地，在它的平原之上，有了一片容纳着150万的居住者广袤而带着围墙的花园，若隐若现于四周蜿蜒的山脉之中。

source: Nothing prepared you for the beauty of this city: it seemed so completely designed.
zh_cn: 这个城市的美丽让人措手不及：它看上去规划得如此完整。

source: Green burst up from the open courtyards like frozen explosions, and traditions survived that were a thousand years old.
zh_cn: 青翠草木犹如冷凝爆炸般从开阔中庭迸发而出，沿袭而来的传统长达千年之久。

source: Among my father's first memories are paper kites flying in the sky, blue-coated men with pigtails and uncut finger-nails, and old women shuffling along on bound feet.
zh_cn: 最早出现在我父亲记忆里的，是天空中飞扬的纸风筝，留着辫子和长指甲的蓝衫男人，还有以裹足踯躅前行的老妪。

source: "I saw them all the time, slightly hobbled.
zh_cn: “我总是看到她们，步态带着些许蹒跚。

source: I was fascinated by their feet - they were absolutely tiny.
zh_cn: 我好奇于她们的双脚——它们实在是太小了。

source: I didn't realise how hideously deformed they were."
zh_cn: 当时没有觉察到它们是多么荒诞不经地丑陋。”

source: With his black armband still on, he entered a Peking that was barely touched by the modern world: a unique, unindustrialised city protected by a series of high crenellated walls within walls.
zh_cn: 父亲仍然带着他的黑臂纱，进入了一个几乎未曾被现代世界触碰过的北京：一个独一无二的，被一连串层层叠叠雉堞状高墙保护起来的，尚未工业化的城市。

source: These 40-foot battlements of hardened grey brick were surmounted at intervals by heavy 15th-century watch-towers, with rose-coloured gates that closed at dusk.
zh_cn: 这些40英尺高的，用硬化青砖堆砌起来的城垛，每隔一段距离便被覆顶以巨大的，15世纪时的瞭望台，带着黄昏时分就关闭起来的玫瑰色大门。

source: The great metal-studded portals stand guard over an unusually low city in the photos that we flick through on our ten-hour flight to Beijing - as Peking became known officially, in 1958, under Mao Zedong, who had established the People's Republic in 1949.
zh_cn: 这些宏伟的带着墙筋壁骨的门户，守护着一座在飞往北京十小时的航程中，出现我们浏览图片里异常低洼的城市——1958年以北京正式为人所知，在1949年建立了人民共和国的毛泽东的时代里。

source: In one image captured by my grandmother's Box Brownie, my father, actually wearing a pith helmet, stands on the roof of the Jesuit observatory (above), then one of Peking's tallest buildings, and looks down on a horizon broken by the golden roofs of the Forbidden City-"winged as if to take flight" in Harold Acton's words.
zh_cn: 在一张由我的祖母用布朗尼盒式相机抓拍的相片里，我的父亲，实际上戴着一顶遮阳帽，站在了当时北京的最高建筑物耶稣会天文台的楼顶上（上图），俯看着被紫禁城的金色屋檐打破了的地平线——“展翅状仿佛要腾空而起”，用哈罗德艾克顿（Harold Acton）的话来说。

source: Acton was one of several British writers living in Peking.
zh_cn: 艾克顿是数个生活在北京的英国作家之一。

source: Robert Byron was finishing "The Road to Oxiana" in Acton's house, and disagreed with him about Chinese architecture: "These are tents, booths and summerhouses, pshaw! - contraptions for bazaars."
zh_cn: 罗伯特拜伦（Robert Byron）在艾克顿的屋子里完成了旅游随笔《前往阿姆河之乡》，关于中国的建筑，他与艾克顿有着分歧的意见：“那些就是帐篷、棚屋和凉亭，嘁！——对于街市来说的新奇设计。”

source: Also there were I.A. Richards, the founder of modern literary criticism, and the scholarly forger and fantasist Edmund Backhouse, a homosexual Old Wykehamist who entertained visitors with memories of the last empress, Cixi, whom he claimed personally to have bedded 200 times.
zh_cn: 还有I.A. 理查兹（ I.A. Richards），现代文学评论的创始人，以及学术伪造者和幻想家，埃德蒙?拜克豪斯（Edmund Backhouse），一位温彻斯特公学的老校友，一个私人宣称与末代皇后慈禧同床共枕了200次，且著作了关于慈禧的回忆录，并以此娱乐了访客的同性恋。

source: All these men were visitors to the British Legation, my father's home for the next two years.
zh_cn: 所有这些人都是我父亲接下来两年的家宅所在地，英国公使馆的造访者。

source: The family bungalow was reached through a large brick gate on British Road (later rechristened Righteousness Road by the Communists).
zh_cn: 这处家庭别墅经由不列颠路（后由共产党重新命名为正义路）上一扇宽敞的砖砌大门进入。

source: Inside the walled compound were 22 houses with tiled fireplaces and chintz curtains. It was an artificial existence.
zh_cn: 它来自实物仿造。院墙里面是22栋带着瓷砖壁炉和印花棉布窗帘的房屋。

source: The legation was a microcosm of small-town England, where people moved, according to another writer, Peter Fleming, "with the slow, stately and mysterious grace of fish in an aquarium.
zh_cn: 公使馆是英格兰小镇的缩微版，人们迁入于此，依照另外一个作家彼得弗莱明（Peter Fleming）的说法，“带着鱼缸里的鱼所具有的，缓慢，庄严而又神秘的优雅。

source: Round and round they go, serene and glassy-eyed".
zh_cn: 他们一遍又一遍地兜着圈子，平静且目光呆滞。”

source: There was a theatre, a bowling alley, a squash court; and sentries from the Worcestershire Regiment, to which my grandfather was attached, punctually mimicked the changing of the guard at Buckingham Palace.
zh_cn: 这里有一个剧院，一个保龄球馆，一个壁球场；来自我父亲所隶属的，英国陆军编制近卫兵部队伍斯特郡团的警卫，极像样地模仿了白金汉宫守卫的轮换更替。

source: They were there in response to the 1900 Boxer Rebellion, in which an ambassador had been killed and the Legation Quarter put under siege for 55 days by the Society of the Righteous and Harmonious Fists - a nationalist sect that had plotted to massacre all foreigners and halt European encroachment and gunboats.
zh_cn: 这是针对1900年义和团运动的防备措施，这场运动使一位大使被杀，公使馆被义和团——一个密谋屠杀所有外国人，阻止欧洲侵犯和炮艇的民族主义教派围困了55天。

source: The garrison was a defiant blast of reassurance, addressed principally to Peking's 1,000-strong British community.
zh_cn: 貌似挑衅的卫戍部队带来了一阵安慰，主要致力于保护北京的千余英属社区。

source: The only Chinese speaker, it was said, was the legation parrot.
zh_cn: 唯一会说中国话的，据说是公使馆里的鹦鹉。

source: Fronted by two stone lions, the ugly grey gate carried the words "Lest We Forget".
zh_cn: 这扇丑陋的灰色大门正面端坐着两尊石狮子，门上带有文字“矢志不忘”。

source: Communication with the population outside was minimal.
zh_cn: 这里与外界的交流极少。

source: The handful of Chinese within the legation were "house-boys" or "coolies" who brought water to the bungalow on creaking single-wheeled barrows, and carried away the "night-soil" - plus mounds of wilting pansies and chrysanthemums.
zh_cn: 出现的少数几个中国人是公使馆里的“男勤杂工”或“苦力工”，他们用吱嘎作响的独轮手推车送水到别墅里，并运走“夜香”——加以成堆枯蔫的三色紫罗兰和菊花。

source: My father's Pekinese, Winks, scampered through flower-beds in constant full bloom which were changed from day to day.
zh_cn: 我父亲的北京犬，温克斯，穿梭嬉戏于被日复一日更换着的，鲜花盛开的花坛里。

source: "A coolie would turn up with basketfuls of pansies on a shoulder-pole, and the gardener pushed them in overnight.
zh_cn: “苦力工会挑着一扁担几篮子的紫罗兰到来，园艺工就连夜把它们插种好。”

source: " Otherwise, entry was by letter of introduction.
zh_cn: 另外，进入许可须凭介绍信。

source: My grandparents mingled socially with the Chinese only at Paomachang, the dusty racecourse four miles away.
zh_cn: 我的祖父母与中国人融合的社交场所仅限于跑马场，几英里之外尘土飞扬的赛马场。

source: Here my grandmother displayed what Acton called "the adaptability of the more masculine, hard-riding, happy-go-lucky type of Englishwoman who haunted Paomachang". She kept two small, stout, pessimistic Mongolian ponies, Contango and Comyangpat, and raced them in her colours, orange and green.
zh_cn: 在那里，我的祖母展示了艾克顿所谓的“经常光顾跑马场的，更具男子气概的，善骑而又逍遥自在，这种类型英国女人的适应能力。”她有两匹小小的，墩实而又可悲的蒙古马，Contango和Comyangpat，以她的颜色，橙色和绿色，来让它们参加跑马比赛。

source: The Chinese, who liked to gamble, bet their shirts on them.
zh_cn: 好赌的中国人，把所有家当都押在了它们的身上。

source: Peking in those days was a magical place: "you may travel far and wide", Acton wrote, "but you will never find a city so beautiful, so complete."
zh_cn: 当时的北京是一个奇幻之地：“你可以四处游历，”艾克顿写道，“但你从来不会发现一个城市会这么美丽这么完备。”

source: Even so, danger could appear without warning.
zh_cn: 尽管如此，危险会毫无征兆地出现。

source: My father's English nanny shielded him from the trauma of witnessing a beheading, but was powerless in the face of sudden illnesses, like those which had carried off a recent ambassadress and at least one third secretary.
zh_cn: 我父亲的英国保姆使其免遭了目睹杀头会带来的心理阴影，但在突如其来的病痛面前，还是显得无能为力，就像那些使一位近代的大使夫人以及至少三分之一的秘书死亡的疾病。

source: From lettuce grown locally and washed in "night-soil", my father and his younger sister caught dysentery and very nearly died.
zh_cn: 因为当地种植并用“夜香”浇灌的莴笋，我父亲和她年轻的妹妹感染了痢疾，几乎丧命。

source: "I see myself in a hospital bed being fed a bowl of stewed apples every day for six weeks.
zh_cn: “我见证了自己躺在一家医院的病床上，连续六个星期每天都被喂食一碗炖苹果。

source: I have never been able to eat stewed apple again."
zh_cn: 以致于我对炖苹果再也没有过食欲。”

source: Major Shakespeare's two children - his first patients in China - were saved by sulphonamide pills, a precursor to penicillin.
zh_cn: 梅杰莎士比亚（Major Shakespeare）的两个孩子——他在中国的首批病患——得救于磺胺类药丸，盘尼西林的一种前体。

source: From then on, the family kept rigorously to English food and scrubbed their vegetables in a solution of permanganate of potash.
zh_cn: 自此，一家人严苛地坚守着英式饮食，并且在高锰酸钾溶液里擦洗消毒他们的蔬菜。

source: The prospect of an authentic Chinese meal is something else that excites my father about returning.
zh_cn: 对于一顿正宗中餐的期待是我父亲饶有兴趣重回故地的另外原因。

source: Not all the dangers were to do with disease.
zh_cn: 并不是所有的威胁都与疾病有关。

source: The previous July, Lloyd George's former private secretary, Gareth Jones, had been kidnapped on the Mongolian border after visiting a Swede who bred the sturdy horses my grandmother bought at auction (for ?5). A ransom demand was dispatched to Peking, allegedly along with "fingers sent in a nice red box", and when it was not paid, Jones was killed.
zh_cn: 我祖母曾在拍卖会上用5英镑买到了一个瑞典人饲养的骏马，先前的七月份，洛伊德?乔治（Lloyd George）的前私人秘书格瑞斯?琼斯（Gareth Jones）在造访了这个瑞典人之后，即在蒙古边境遭到了绑架，赎金索求被转达到北京，据说还有“装在精致红盒子里的手指”，当其没有被兑付时，琼斯随即殒命。

source: His death had a special resonance for my grandfather: his brother Geoffrey had been Jones's predecessor as Lloyd George's private secretary.
zh_cn: 他的死对我的祖父有着一种特别的触动：他的兄弟杰弗里（Geoffrey）是洛伊德乔治私人秘书琼斯的前任。

source: Because kidnappers and warlords stalked the Western Hills 12 miles away, my grandfather dared not risk taking his family to see the temples there, much to my father's disappointment.
zh_cn: 由于绑匪和军阀盘踞着12英里外的西山，我的祖父不敢冒险带他家人去游览那里的寺庙，这令我的父亲极其失望。

source: The purplish outline of the hills, which reminded some of the delicate colour of bluebells and others of the undulating body of a subterranean dragon, was tantalisingly visible as he looked out from the legation.
zh_cn: 西山略带紫色的轮廓，使人联想到风铃草柔和的色彩和一条卧地潜龙起伏的身躯，从公使馆里远眺出去，可望不可及。

source: Threats existed even closer to Peking.
zh_cn: 危险甚至存在于距离北京更近的地方。

source: The ambassador's daughter was out riding one day when she fell unconscious from her pony, struck by an assassin's bullet intended for her father.
zh_cn: 有一天大使的女儿正在外体验骑行乐趣，就在这时被一颗刺客意在其父亲的子弹击中，从她的小马上跌落下来不省人事。

source: A friend of our family, the third secretary Gerry Young, found the 0.22 bullet embedded in her forehead, and tried to extract it using the chancery key.
zh_cn: 我们家的一位朋友，第三任秘书格里?扬（Gerry Young）发现了射进她前额内点22的弹头，并企图用使馆的钥匙来将它取出来。

source: "After a good deal of poking and prodding," she wrote in her diary, "the bullet was levered out."
zh_cn: “经过好一番戳弄，”她在日记里写道，“子弹被起了出来。”

source: They ended up marrying.
zh_cn: 他们最终结为了夫妻。

source: Four months later, in August 1937, her father was machine-gunned by a Japanese pilot who claimed to have mistaken the ambassadorial car for one containing the Chinese Nationalist leader, Jiang Jieshi (Chiang Kai-shek).
zh_cn: 四个月之后的1937年8月，她的父亲被一个日本飞行员的机枪射中，飞行员声称把大使的轿车误当作了乘坐着中国国民党领导人蒋介石的另外一辆车。

source: "I suddenly became aware", Knatchbull-Hugessen later wrote, "of something very hard going very fast through my middle­" The bullet grazed his spine, put him in hospital for two months, and ended his posting.
zh_cn: “我突然觉得，”许阁森后来写道，“非常硬的某样东西十分快速地穿过了我的腰部......”子弹擦伤了他的脊椎，致使他住了两个月的医院，并让他离开了工作岗位。

source: Despite the ongoing civil war between the dominant Nationalists and the insurgent Communists, Japan posed the graver danger.
zh_cn: 尽管占有统治地位的国民党和反抗力量共产党之间的内战正如火如荼，日本却构成了最严重的威胁。

source: Enfeebled, divided and relying on out-of-date equipment, the Chinese were powerless to check the territorial ambitions of their aggressive neighbour.
zh_cn: 软弱涣散，落后的装备，使得中国人在遏制他们喜好侵略之邻国的领土扩张野心时，显得无能为力。

source: After marching into Manchuria to the north in 1931, Japanese troops now encircled Peking, with a camp just nine miles from the Diplomatic Quarter.
zh_cn: 1931年，在长驱直入满洲地区一路向北之后，日军包围了北京城，有一处营地仅仅距离使馆区九英里之遥。

source: The population waited for their inevitable arrival in a state of tension, including my grandmother - following a disagreeable incident when she rode into Manchuria to get some highly prized stamps for my father.
zh_cn: 人人都在紧张的状态中，等待着日军无法避免的到来，包括我的祖母——横生了不合时宜的枝节，在她为我的父亲想得到一些弥足珍贵的邮票，而骑行进入满洲时。

source: She tethered her pony outside the little post office over the border, and when she emerged a Japanese soldier was sitting in her saddle, smirking and taunting her.
zh_cn: 她将她的小马拴在了边境之外小邮局的外面，当她出来时，一个日本士兵正坐在她的马鞍上，傻笑着嘲讽她。

source: There was a stand-off and finally the soldier dismounted.
zh_cn: 一段僵持之后最终，这个士兵下马而去。

source: In Peking, my father adopted a technique of non-recognition: "We were aware they were encroaching, that they were the enemy.
zh_cn: 在北京，我的父亲采取了不认可方法：“我们意识到他们正在实施侵犯行为，他们是敌人。

source: So I kept staring at the boots of the sentries outside the Japanese Legation, which embarrassed them enormously." The Japanese Legation was directly opposite the British, and he would watch tiny officers on huge Russian horses conduct manoeuvres in the street.
zh_cn: 所以我目不转睛地盯着门口日本哨兵的靴子，背后是让他们极其局促不安的日本公使馆。”日本公使馆在英国公使馆的正对面，他会看着街面上坐在俄国高头大马上的小军官们进行军演。

source: The fear of what the Japanese would do to the expat community - and did do later that year to hundreds of thousands of Chinese in Nanking - was crystallised in the brutal and unresolved murder, ten months after my father's arrival, of a blonde teenage girl who had attended the same convent school as him.
zh_cn: 对于日本人会如何对待外籍人士——是年年末在南京，的确，对数以十万计的中国人，付诸了实施——这种恐惧——在一桩残忍且悬而未决的谋杀中，得到了具体化，事件发生在我父亲到达北京十个月之后，当事对象是同我父亲一样就读于修道院学校的金发少女。“

source: "I overheard my parents talking in hushed tones, about a boy who had been kidnapped, I thought." More likely they were discussing Pamela Werner, whose violent death sent a shock wave through the foreign community.
zh_cn: 我无意中听到我的父母用隐秘的口气，在谈论着一个被绑架了的男孩，我原以为。”极为可能，他们在讨论着帕米拉?沃纳（Pamela Werner），她的暴毙，在涉外社区中激起了轩然大波。

source: Was this the horror that awaited them all?
zh_cn: 是否这就是即将降临在他们所有人身上的恐怖事情呢？

source: Pamela was the 19-year-old daughter of a former British consul.
zh_cn: 帕米拉是一位前英国领事19岁大的女儿。

source: On January 8th 1937 her body was discovered on scrubby waste ground below a watchtower near the legation.
zh_cn: 1937年1月8日，她的尸体被发现于公使馆附近一座瞭望塔下杂草丛生的荒地里。
